In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

# Series

In [3]:
Name = pd.Series(["Balajee", "Thanigai", "Dhivagar", "Zameer"], index = [1,2,3,4])

In [4]:
Name

1     Balajee
2    Thanigai
3    Dhivagar
4      Zameer
dtype: object

In [5]:
Age = pd.Series([20, 19, 18, 21], index = [1,2,3,4])

In [6]:
Age

1    20
2    19
3    18
4    21
dtype: int64

# Data Frame

In [7]:
df = pd.DataFrame(Name, columns=["Name"])

In [8]:
df

       Name
1   Balajee
2  Thanigai
3  Dhivagar
4    Zameer

In [9]:
df["Age"]=Age

In [10]:
df

       Name  Age
1   Balajee   20
2  Thanigai   19
3  Dhivagar   18
4    Zameer   21

In [12]:
Candidate = {"CGPA":{1:"7.75", 2:"8.25", 3:"8.50", 4:"8.75"}, "Specialization":{1:"YES", 2:"YES", 3:"NO", 4:"NO"}}

In [13]:
Candidate

{'CGPA': {1: '7.75', 2: '8.25', 3: '8.50', 4: '8.75'},
 'Specialization': {1: 'YES', 2: 'YES', 3: 'NO', 4: 'NO'}}

In [20]:
df = pd.DataFrame(Candidate, columns = ["CGPA","Specialization"])

In [21]:
df

   CGPA Specialization
1  7.75            YES
2  8.25            YES
3  8.50             NO
4  8.75             NO

In [26]:
    Candidate = {"Name":{1:"Balajee", 2:"Thanigai", 3:"Dhivagar", 4:"Zameer", 5:"Eshwar"},"CGPA":{1:"7.75", 2:"8.25", 3:"8.50", 4:"8.75", 5:"9.50"},"REG.NO":{1:"122012012787", 2:"122012012887", 3:"122012012999", 4:"122012012888", 5:"122012012889"},"yearofstudy":{1:"3", 2:"3", 3:"3", 4:"3", 5:"3"} ,"Specialization":{1:"YES", 2:"YES", 3:"NO", 4:"NO", 5:"NO"}}

In [28]:
df = pd.DataFrame(Candidate, columns = ["Name","Specialization","REG.NO","yearofstudy","CGPA"])

In [29]:
df

       Name Specialization        REG.NO yearofstudy  CGPA
1   Balajee            YES  122012012787           3  7.75
2  Thanigai            YES  122012012887           3  8.25
3  Dhivagar             NO  122012012999           3  8.50
4    Zameer             NO  122012012888           3  8.75
5    Eshwar             NO  122012012889           3  9.50

In [37]:
x = df.drop(columns = ["Specialization"])

In [39]:
y = df["Specialization"]

In [40]:
x

       Name        REG.NO yearofstudy  CGPA
1   Balajee  122012012787           3  7.75
2  Thanigai  122012012887           3  8.25
3  Dhivagar  122012012999           3  8.50
4    Zameer  122012012888           3  8.75
5    Eshwar  122012012889           3  9.50

In [41]:
y

1    YES
2    YES
3     NO
4     NO
5     NO
Name: Specialization, dtype: object